# Terminal
cask "ghostty"

# Shell & prompt
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Multiplexer
brew "zellij"

# Modern CLI replacements
brew "eza"          # ls  — icons, colors, git-aware
brew "bat"          # cat — syntax highlighting
brew "fd"           # find — faster, simpler syntax
brew "ripgrep"      # grep — blazing fast
brew "zoxide"       # cd  — learns your habits
brew "git-delta"    # diff — beautiful git diffs
brew "tldr"         # man — community cheat sheets
brew "fzf"          # fuzzy finder

# Dev tools
brew "git"
brew "lazygit"
brew "jq"
brew "mise"         # runtime manager (node, python, go, etc.)
brew "direnv"

# Utilities
brew "btop"         # system monitor
brew "duf"          # disk usage
brew "dust"         # directory sizes
